'use strict';

<<<<<<< HEAD

//Зададим функцию:
function hello(name) { //укажем здесь параметр name, в котором будет лежать имя человека
	//Введем переменную text, в которую запишем всю фразу:
	var text = 'Привет, ' + name;

	/*
		Укажем функции с помощью инструкции 'return', 
		что мы хотим, чтобы она ВЕРНУЛА содержимое переменной text:
	*/
	return text;
}

//Теперь вызовем нашу функцию и запишем значение в переменную message:
var message = hello('Дима');

//И теперь в переменной text лежит 'Привет, Дима!':
alert(message); //убедимся в этом
alert(hello('Вася') + ' ' + hello('Петя') + ' ' + hello('Коля'));
=======
alert("Привет , йцу!!!");
>>>>>>> 492a694e621a2c1ff224ac884cd629c388090eeb
